[
    {
        "id": 1,
        "title": "FinanChill",
        "mini": "A simple app to make budgeting more relaxed than ever",
        "description": "This budgeting app helps uses to stay accountable for their budgeting over time by compiling their spending and saving information into a neatly displayed and informative user interface. Users are given an illustrative history of their spending habits and net financial accumulation, and are provided with suggestions about future purchases which they might be considering.",
        "tech": "Node js, SQL, Materialize, Chartist js",
        "npm": "npm Packages: sequelize, mySQL, passport, bcryptjs, express, express-session, express-handlebars",
        "src1": "financhill1.png",
        "src2": "financhill2.png",
        "Deployed": "https://dashboard.heroku.com/apps/desolate-sierra-38032",
        "Github": "https://github.com/GabeSucich/BudgetingApp"
    },
    {
        "id": 2,
        "title": "Project Miles",
        "mini": "Helping youth to stay active and make healthy choices",
        "description": "Project Miles is an application which helps to promote healthy choices in young adolescents by gamifying the endeavor to live an active lifestyle. Users can choose a Marvel avatar to theme their experiences. When they are looking to eat or do an activity, they can enter specific information, and the app will reward them with points for choosing make healthy food choices or to exercise more. Project Miles integrates the input from the user in a sequence of API calls which can locate healthy food choices arround the user or to reward points for distance traveled in an active manner.",
        "tech": "ajax, jQuery, Materialize",
        "npm": "",
        "src1": "miles1.png",
        "src2": "miles2.png",
        "Deployed": "https://gabesucich.github.io/Project1_CGJK/",
        "Github": "https://github.com/GabeSucich/Project1_CGJK"
    },
    {
        "id": 3,
        "title": "React Google Books",
        "mini": "Search a vast array of books for new reads",
        "description": "This application allows uses to search for and save books which they are interested in reading. It is a MERN (Mongoose Express React Node) full stack application. Users can search for books from the google books API, and the top results are quickly displayed for browsing. Upon saving a book, users can then view it in their library, with the option to delete it at any time. A react front end processes user input, and an express server is listening for request to fetch information from the google book API, as well as storing or retriving saved books in a mongodb. The different facets of MERN yield a polished and facile book-keeping (no pun intended) user interface, with smooth application functionality.",
        "tech": "React, Nodejs",
        "npm": "npm Packages: mongoose, react-router-dom, axios, express",
        "src1": "Books1.png",
        "src2": "Books2.png",
        "Deployed": "https://immense-everglades-13293.herokuapp.com/",
        "Github": "https://github.com/GabeSucich/GoogleBooksReact"
    },
    {
        "id": 4,
        "title": "Fitness Tracker",
        "mini": "Track and view your workouts to make consistent progress with your fitness",
        "description": "In the fitness community, you would be hard-pressed to find someone who does not track their progress. Whether you are amongs power lifters, runners, yogis, or body builders, keeping track of the numbers while you workout is a tried and true method for achieving your goals. This application allows people to track their workouts by entering them into a database. Users can add as many exercises to a workout as they would like, and create new workouts each day. Users can then see their exercise information displayed graphically for an informative view into their progress. This application uses an express server to listen for client-side endpoint requests. It then serves or stores the client's workout information using the mongoose ODM (object document mapper) which queries a noSQL databse.",
        "tech": "Bootstrap, jQuery",
        "npm": "npm Packages: mongoose",
        "src1": "Fitness1.png",
        "src2": "Fitness2.png",
        "Deployed": "https://dashboard.heroku.com/apps/calm-crag-14292",
        "Github": "https://github.com/GabeSucich/FitnessTracker"
    },
    {
        "id": 5,
        "title": "Quarantine TV Tracker",
        "mini": "Keep track of all the shows you have finished during the COVID quarantine",
        "description": "With the onset of COVID-19, more people than ever find themselves in need of good TV shows to watch. This application allows users to track their TV escapades, saving TV shows to a watchlist, and afterward to a favorites list. Through the use of Handlebars as a template engine and storage of user data in a SQL database, this application can swiftly provide the user with accurate data on a polished interface.",
        "tech": "Node js, SQL, Handlebars, Materialize",
        "npm": "npm Packages: mySQL, express, express-handlebars",
        "src1": "showbinger1.png",
        "src2": "showbinger2.png",
        "Deployed": "https://secure-depths-32676.herokuapp.com/",
        "Github": "https://github.com/GabeSucich/ShowBinger"
    },
    {
        "id": 6,
        "title": "Password Generator",
        "mini": "Never let your accounts get hacked again",
        "description": "The hassle of coming up with a strong new password for every new account often leads user to use weak passwords which leave information vulnerable. This application instantly produces a random password for users which provides a solution to this problem. The user is prompted for different kinds of characters to include in the password, and then produces a completely randomized password which includes these characters. Though this app is simplistic in nature, it uses cogently-composed algorithms and recursion to simplify the password-generating process to remarkably few lines.",
        "tech": "Bootstrap, jQuery",
        "npm": "",
        "src1": "password1.png",
        "src2": "password2.png",
        "Deployed": "https://gabesucich.github.io/Homework03_PasswordGenerator/",
        "Github": "https://github.com/GabeSucich/Homework03_PasswordGenerator"
    }
]